export const default_categories = [
  {
    id: 1,
    name: 'Основные жизненные потребности',
    children: [
      {
        id: 2,
        name: 'Жилищные расходы',
        children: [
          { id: 3, name: 'Аренда/Ипотека' },
          { id: 4, name: 'Коммунальные' },
        ],
      },
      {
        id: 5,
        name: 'Питание',
        children: [
          { id: 6, name: 'Продукты' },
          { id: 7, name: 'Рестораны/Кафе' },
          { id: 8, name: 'Кофе/Перекусы' },
        ],
      },
      {
        id: 9,
        name: 'Одежда и обувь',
        children: [
          { id: 10, name: 'Одежда' },
          { id: 11, name: 'Обувь' },
          { id: 12, name: 'Аксессуары' },
        ],
      },
    ],
  },
  {
    id: 13,
    name: 'Транспорт и передвижение',
    children: [
      {
        id: 14,
        name: 'Транспорт',
        children: [
          { id: 15, name: 'Топливо' },
          { id: 16, name: 'Страховка' },
          { id: 17, name: 'Обслуживание' },
          { id: 18, name: 'Парковка' },
        ],
      },
    ],
  },
  {
    id: 19,
    name: 'Здоровье и спорт',
    children: [
      {
        id: 20,
        name: 'Здоровье',
        children: [
          { id: 21, name: 'Страховка' },
          { id: 22, name: 'Лекарства' },
          { id: 23, name: 'Посещение врача' },
          { id: 24, name: 'Спортивные клубы' },
        ],
      },
    ],
  },
  {
    id: 25,
    name: 'Связь и развлечения',
    children: [
      {
        id: 26,
        name: 'Сеть и интернет',
        children: [
          { id: 27, name: 'Мобильная связь' },
          { id: 28, name: 'Интернет' },
          { id: 29, name: 'Подписки' },
        ],
      },
      {
        id: 30,
        name: 'Развлечения и досуг',
        children: [
          { id: 31, name: 'Кино/Театр' },
          { id: 32, name: 'Путешествия' },
          { id: 33, name: 'Хобби и увлечения' },
        ],
      },
    ],
  },
  {
    id: 34,
    name: 'Саморазвитие',
    children: [
      {
        id: 35,
        name: 'Образование',
        children: [
          { id: 36, name: 'Книги' },
          { id: 37, name: 'Курсы' },
        ],
      },
    ],
  },
  {
    id: 38,
    name: 'Финансовые обязательства',
    children: [
      { id: 39, name: 'Налоги' },
      { id: 40, name: 'Кредиты' },
      { id: 41, name: 'Пенсионные отчисления' },
      { id: 42, name: 'Штрафы' },
      {
        id: 43,
        name: 'Подарки и благотворительность',
        children: [
          { id: 44, name: 'Подарки близким' },
          { id: 45, name: 'Пожертвования' },
        ],
      },
    ],
  },
  { id: 46, name: 'Прочие расходы' },
];
